export const predefinedTypes = [
    "肃烈金",
    "无根木",
    "浮生水",
    "燎原火",
    "承坤土",
    "机械领主",
    "衔风神女",
    "钢铁之心",
    "狂暴丽影",
    "异常专家",
    "流派大师",
    "美梦成真",
    "超级星推官",
];

export const predefinedGroups = {
    "异常专家": {
        3: "异常增伤提升30%",
        6: "每次施加异常状态，伤害提升12%，持续10秒，可叠加3层。"
    },
    "流派大师": {
        3: "所有流派大师关键字的卡牌效果大幅强化。",
        5: "每拥有1张流派大师卡牌，攻击力和生命值提升8%"
    },
    "美梦成真": {
        2: "激活出战英雄所有未解锁的战术技能。",
        3: "全部战术技能提升至满"
    },
    "超级星推官": {
        1: "武器随星级提升伤害，每个星级提升2.5%。",
        2: "武器随品质提升伤害，每个品质提升15%"
    },
    "狂暴丽影": {
        2: "使用技能时20%概率触发狂暴时刻。",
        4: "狂暴时刻的持续时间提升100%"
    },
    "钢铁之心": {
        2: "武器附魔：每隔6秒使武器命中25%概率触发【咬击】，【咬击】造成3000%攻击力伤害并回复5%生命值。",
        4: "武器附魔：每隔4秒使武器命中50%概率触发【咬击】，【咬击】造成5000%攻击力伤害并回复5%生命值。",
        5: "保持60%血量以上，武器单发伤害提升40%"
    },
    "机械领主": {
        2: "提升50%弹夹容量上限，每50发增加3%伤害，最多可提升10层。",
        4: "磁暴附魔：射击命中有15%概率触发磁暴，造成500%攻击力伤害，可享受爆炸增益。",
        6: "磁暴附魔：射击命中有25%概率触发磁暴，造成700%攻击力伤害，可享受爆炸增益。"
    },
    "衔风神女": {
        2: "每过8秒在随机位置生成一个可以吸收伤害的机关球，机关球会在5秒后爆炸，释放出吸收伤害的20%。",
        4: "机关雷球的生成数量加一",
        6: "机关雷球的爆炸伤害，会赋予目标40%的伤害易伤，持续5秒"
    },
    "无根木": {
        3: "英雄每浮空1秒可以积攒2层木元素，英雄浮空时伤害提升30%。",
        5: "激活苍郁之木效果，若释放技能时木元素大于，攻击被缠绕的敌兵时会飞出木刺，攻击被缠绕的敌兵造成伤害提升40%。",
        8: "英雄浮空期间也会有额外木刺攻击敌人，英雄浮空时伤害额外提升50%。"
    },
    "浮生水": {
        3: "每召唤一只召唤物积攒2层水元素，场上每存在一个召唤物时，英雄伤害提升提升5%，最多30%。",
        5: "激活玄冥之息效果，若释放技能时水元素大于10层，水弹幕会弹跳一次，水弹幕每造成一次伤害英雄提升1%伤害，最多为40%。",
        8: "常驻一个水弹发射装置，射速根据当前的水元素层数决定，在水弹发射装置周围伤害升50%"
    },
    "肃烈金": {
        3: "每消耗50发子弹可以积攒2层金元素，每拥有100发弹夹提升10%伤害。",
        5: "激活蓐收之息效果，若释放技能时金元素大于10层则射速提升40%，持续10秒。",
        8: "任何时候金元素大于10层时，都会获得射速提升50%并且不消耗子弹的效果（溢出的射速等比转换为伤害）。"
    },
    "承坤土": {
        3: "释放战技可以积攒2层土元素，并且获得30%大招充能速度提升和冷却缩减。",
        5: "激活后土之息效果，若释放技能时土元素大于10层则土盾结束时会爆炸，炸盾后获得40%伤害提升，持续10秒。",
        8: "土盾爆炸之后会再次加给英雄一次，炸盾时重置技能冷却，并且持盾期间大招充能速度增加50%。"
    },
    "燎原火": {
        3: "每触发一次强化武器可以积攒2层火元素，并且武器伤害提升30%。",
        5: "激活祝融之息效果，若释放技能时火元素大于10层则火圈停留时间翻倍，并且火圈存在期间英雄获得40%伤害加成。",
        8: "火圈范围翻倍，火圈存在期间每秒获得一层强化武器。"
    }
}
